TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/гкс_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.гкс_ЗаданияНаКомпозитныеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ФактическиеПоказателиКачества</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыРегистрации</registerRecords>
  <attributes>
    <name>ВидЛабораторногоАнализа</name>
    <type>
      <types>CatalogRef.гкс_ВидыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаПолученияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СостояниеТранспортногоСредства</name>
    <type>
      <types>EnumRef.гкс_СоответствиеТребованиям</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативнаяСертификация</name>
    <type>
      <types>DocumentRef.гкс_НормативнаяСертификацияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СоответствуетНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонениеОтБазиса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <comment>ERP-1475</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСоотвествия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсиленныйКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗначениеВнешнейПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешняяПроба</name>
      <type>
        <types>DocumentRef.гкс_ВнешняяПроба</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяСуммаВнешнейПробы</name>
      <comment>Контрольная сумма MD5</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиДляПерепроверки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользованияКачества</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СтатусыЛабораторногоАнализа/гкс_СтатусыЛабораторногоАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СтатусыЛабораторногоАнализа</name>
  <enumValues>
    <name>ОтборПробы</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтмена</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторЗамераПроведение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступностьЭлементовФормы();

	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.ОтборПробы;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		гкс_УправлениеДоступом.ОпределитьДоступностьВозможностьИзмененияДокументаПоРеестру(ЭтотОбъект, Объект);
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
        ИдентификаторЗамераПроведение = 
		ОценкаПроизводительностиКлиент.ЗамерВремени("ПроведениеДокумента.Интерактивно.ЛабораторныйАнализ", 
		                                            Истина);
		
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Не ПараметрыЗаписи.Свойство("ЕстьВопросыПередЗаписью")
			И ДокументУчаствуетВУсиленномКонтроле(
				Объект.гкс_ДокументРегистрации, Объект.гкс_НазначениеИспользованияКачества) Тогда
				
			Отказ = Истина;	
			ОписаниеОповещенияОЗавершении = 
				Новый ОписаниеОповещения("ПодверждениеРаспроведения", ЭтотОбъект, ПараметрыЗаписи); 
			ТекстВопроса = 
				СтрШаблон(НСтр("ru = 'У документа есть данные по усиленному контролю. Уверены что хотите распровести?'"));
				
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, 
				РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);	
					
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОграничитьДоступКФорме();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеЛабараторногоАнализа");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.УстановитьПризнакОшибкиЗамера(ИдентификаторЗамераПроведение, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеИспользованияКачестваПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ЗаполнитьПоСпецификацииДляИсследования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьПоСпецификацииДляИсследования();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	ОбновитьДатуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРегистрацииПриИзменении(Элемент)
	ЗаполнитьПоСпецификацииДляИсследования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКачественныеПоказатели

&НаКлиенте
Процедура КачественныеПоказателиЗначениеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.КачественныеПоказатели.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда	
		Возврат;	
	КонецЕсли;
	
	ОбновитьСоответствиеБазисуВСтроке(ТекущиеДанные.Показатель);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.ПровестиИЗакрыть(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.Провести(ЭтотОбъект, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.Записать(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификации(Команда)
	
    ЗаполнитьПоСпецификацииДляИсследования();	

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСпецификацию(Команда)
	
	ПодобратьСпецификациюНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область РаботаСФормой

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	УстановитьВидимостьЭлементовФормы();
		
	Если Параметры.Ключ.Пустая() И Параметры.Свойство("ИзАРМа") Тогда		
		ОграничитьДоступностьЭлементовЕслиФормаПодчинена();		
	КонецЕсли;
	
	ОграничитьДоступКФорме();
	
КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступностьЭлементовЕслиФормаПодчинена()
	
	Элементы.ДокументРегистрация.Доступность = Ложь;
	Элементы.Склад.Доступность = Ложь;
	Элементы.Номеннклатура.Доступность = Ложь;
	Элементы.Организация.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.Дата.Видимость = Не ЗначениеЗаполнено(Объект.гкс_МестнаяДата);
	Элементы.МестнаяДата.Видимость = ЗначениеЗаполнено(Объект.гкс_МестнаяДата); 
	
	Если Объект.гкс_НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.Приемка Тогда
		Элементы.ГруппаПоказателиДляКомпозита.Видимость = Истина;
	Иначе
		Элементы.ГруппаПоказателиДляКомпозита.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ОграничитьДоступКФорме()
	
	Если Не ТолькоПросмотр Тогда // может быть уже установлен, если оформлен реестр ЗПП-3 
		ТолькоПросмотр = Не (Пользователи.ЭтоПолноправныйПользователь() ИЛИ ЛабораторныйАнализВыполняется());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьДатуДокумента()
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.гкс_МестнаяДата = Дата(1, 1, 1, 0, 0, 0);
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоответствиеБазисуВСтроке(Показатель)
				
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПроверитьСоотвествиеКачеству(Показатель);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
					
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификацииДляИсследования()

	Если Объект.КачественныеПоказатели.Количество() <> 0 Тогда

		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПоСпецификацииЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличная часть ""Качественные показатели"" будет перезаполнена. 
							|Продолжить выполнение операции?'");

		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ЗаполнитьПоказателиДляИсследования();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоказателиДляИсследования();		
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиДляИсследования()
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокументОбъект.ЗаполнитьПоказателиДляИсследования();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЛабораторныйАнализВыполняется()
	
	Возврат Не Объект.Статус = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен;
	
КонецФункции

&НаСервере
Процедура ПодобратьСпецификациюНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
    ТекущийОбъект.НормативнаяСертификация = гкс_РаботаСПоказателямиНоменклатуры.
		НормативнаяСертификацияПоФактическомуКачеству(ТекущийОбъект);
		
	ТекущийОбъект.ПроверитьСоотвествиеКачеству();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументУчаствуетВУсиленномКонтроле(ДокументРегистрации, НазначениеИспользования)
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС") Тогда
		Возврат Ложь;
	КонецЕсли;	
	Назначения = Новый СписокЗначений;
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Назначения.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	Если Назначения.НайтиПоЗначению(НазначениеИспользования) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;    
	
	Возврат 
		гкс_ВходнойКонтрольКачества.ЕстьДанныеПоУсиленномуКонтролю(ДокументРегистрации);	  
	
КонецФункции	

&НаКлиенте
Процедура ПодверждениеРаспроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		гкс_ОбщегоНазначенияПЛККлиент.ОтменаПроведения(ЭтотОбъект, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
